config/experiments/bash-parser/bash-parser-semantics.org
#+title: Bash Parser - Command Semantics Database
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle bash-parser-semantics.el
#+auto_tangle: t

* Introduction

Command semantics database for bash parser.

This module defines file operation semantics for core bash commands, mapping
command names to their file operation patterns. This enables extraction of
file operations from parsed command structures.

The database supports:
- Simple commands (single operation type)
- Flag-dependent commands (operation depends on flags like sed -i)
- Subcommand-based commands (operation depends on subcommand like git add)
- Multi-operation commands (like cp with source and destination)

* Basic Configuration

Setup lexical binding.

#+begin_src emacs-lisp
;;; bash-parser-semantics.el --- Command semantics database -*- lexical-binding: t; -*-

;; Forward declaration for function defined in bash-parser-file-ops.el
(declare-function jf/bash--has-glob-pattern-p "bash-parser-file-ops")
(declare-function jf/bash--resolve-path-variables "bash-parser-file-ops")
#+end_src

* Command Semantics Database

** Semantics Database Structure

#+begin_src emacs-lisp
(defvar jf/bash-command-file-semantics
  '((cat . (:operations ((:source :positional-args :operation :read))))
    (head . (:operations :custom
             :handler jf/bash--extract-head-tail-operations))
    (tail . (:operations :custom
             :handler jf/bash--extract-head-tail-operations))
    (less . (:operations ((:source :positional-args :operation :read))))
    (more . (:operations ((:source :positional-args :operation :read))))
    (wc . (:operations ((:source :positional-args :operation :read))))
    (file . (:operations ((:source :positional-args :operation :read))))
    (stat . (:operations ((:source :positional-args :operation :read))))
    (ls . (:operations :custom
           :handler jf/bash--extract-ls-operations
           :produces-file-list t
           :pattern-source :positional-args
           :search-scope-arg :implicit))
    (grep . (:operations :flag-dependent
             :flag-handlers ((("-l" "--files-with-matches")
                             . ((:source :positional-args :operation :match-pattern :skip-indices (0))))
                            (()
                             . ((:source :positional-args :operation :read :skip-indices (0)))))
             :produces-file-list t
             :pattern-source :positional-args
             :pattern-requires-flag ("-l" "--files-with-matches")))
    (egrep . (:operations :flag-dependent
              :flag-handlers ((("-l" "--files-with-matches")
                              . ((:source :positional-args :operation :match-pattern :skip-indices (0))))
                             (()
                              . ((:source :positional-args :operation :read :skip-indices (0)))))))
    (fgrep . (:operations :flag-dependent
              :flag-handlers ((("-l" "--files-with-matches")
                              . ((:source :positional-args :operation :match-pattern :skip-indices (0))))
                             (()
                              . ((:source :positional-args :operation :read :skip-indices (0)))))))
    (touch . (:operations ((:source :positional-args :operation :create-or-modify))))
    (mkdir . (:operations ((:source :positional-args :operation :create))))
    (rm . (:operations ((:source :positional-args :operation :delete))))
    (rmdir . (:operations ((:source :positional-args :operation :delete))))
    (chmod . (:operations ((:source :positional-args :operation :modify :skip-indices (0)))))
    (chown . (:operations ((:source :positional-args :operation :modify :skip-indices (0)))))
    (chgrp . (:operations ((:source :positional-args :operation :modify :skip-indices (0)))))
    (ln . (:operations ((:source :positional-args :indices (0 . -2) :operation :read)
                        (:source :positional-args :index -1 :operation :write))))
    (cp . (:operations ((:source :positional-args :indices (0 . -2) :operation :read)
                        (:source :positional-args :index -1 :operation :write))))
    (mv . (:operations ((:source :positional-args :indices (0 . -2) :operation :delete)
                        (:source :positional-args :index -1 :operation :write))))
    (tar . (:operations :custom
            :handler jf/bash--extract-tar-operations))
    (zip . (:operations :custom
            :handler jf/bash--extract-zip-operations))
    (sed . (:operations :flag-dependent
            :flag-handlers ((("-i" "--in-place") . ((:source :positional-args :operation :modify :skip-indices (0))))
                           (() . ((:source :positional-args :operation :read :skip-indices (0)))))))
    (find . (:operations :custom
             :handler jf/bash--extract-find-operations
             :produces-file-list t
             :pattern-source :flag-arg
             :search-scope-arg :first-positional))
    (tee . (:operations ((:source :positional-args :operation :write))))
    (dd . (:operations ((:source :named-args :names ("if") :operation :read)
                        (:source :named-args :names ("of") :operation :write))))
    (git . (:operations :complex
            :subcommand-handlers ((add . ((:source :positional-args :operation :read)))
                                 (rm . ((:source :positional-args :operation :delete)))
                                 (checkout . ((:source :positional-args :operation :modify)))
                                 (restore . ((:source :positional-args :operation :modify)))
                                 (mv . ((:source :positional-args :indices (0 . -2) :operation :delete)
                                        (:source :positional-args :index -1 :operation :write)))
                                 (diff . ((:source :positional-args :operation :read)))
                                 (show . ((:source :positional-args :operation :read))))))
    (docker . (:operations :complex
               :subcommand-handlers ((cp . ((:source :positional-args :indices (0 . -2) :operation :read)
                                            (:source :positional-args :index -1 :operation :write))))))
    (npm . (:operations :complex
            :subcommand-handlers ()))
    (cargo . (:operations :complex
              :subcommand-handlers ()))
    (kubectl . (:operations :complex
                :subcommand-handlers ()))
    (python . (:operations ((:source :positional-args :operation :execute :index 0))))
    (python3 . (:operations ((:source :positional-args :operation :execute :index 0))))
    (node . (:operations ((:source :positional-args :operation :execute :index 0))))
    (bash . (:operations ((:source :positional-args :operation :execute :index 0))))
    (sh . (:operations ((:source :positional-args :operation :execute :index 0))))
    (zsh . (:operations ((:source :positional-args :operation :execute :index 0))))
    (source . (:operations ((:source :positional-args :operation :execute :index 0))))
    (\. . (:operations ((:source :positional-args :operation :execute :index 0))))
    (go . (:operations :complex
           :subcommand-handlers ((run . ((:source :positional-args :operation :execute :index 0)))
                                (test . ((:source :positional-args :operation :execute :index 0)))
                                (build . ((:source :positional-args :operation :read :index 0)))))))
  "Database mapping command names to file operation semantics.

Each entry maps a command symbol to a plist describing how the command
interacts with files:

Simple commands:
  (:operations ((operation-spec) ...))

Flag-dependent commands (operation depends on flags):
  (:operations :flag-dependent
   :flag-handlers ((flag-list . operations) ...))

Subcommand-based commands (operation depends on subcommand):
  (:operations :complex
   :subcommand-handlers ((subcommand . operations) ...))

Operation spec format:
  :source - Where file paths come from:
    :positional-args - From positional arguments
    :named-args - From named arguments (like dd if=/path of=/path)
    :redirections - From shell redirections (handled separately)
    :exec-blocks - From find -exec blocks (handled separately)

  :operation - Type of file operation:
    :read - Read file contents
    :write - Create new file or overwrite existing
    :delete - Remove file or directory
    :modify - Change existing file in place
    :create - Create new file (must not exist)
    :create-or-modify - Create or update file
    :execute - Execute file as script or binary
    :match-pattern - Search for files matching pattern
    :read-directory - Read directory contents to find matches

  :index - Single positional argument index (0-based, -1 for last)
  :indices - Range of positional arguments:
    (0 . -2) means all arguments from first to second-to-last
    (0 . -1) means all arguments from first to last
    :all means all positional arguments

  :skip-indices - List of argument indices to skip (e.g., (0) skips first arg)
  :names - List of named argument names (for dd-style commands)")
#+end_src

