config/experiments/bash-parser/bash-parser-semantics.org
** Semantics Lookup Function

#+begin_src emacs-lisp
(defun jf/bash-lookup-command-semantics (command-name)
  "Look up file operation semantics for COMMAND-NAME.

Returns semantics plist from `jf/bash-command-file-semantics', or nil
if command is not in the database.

The returned plist describes how the command interacts with files:
- :operations - Operation specifications or :flag-dependent/:complex
- :flag-handlers - For flag-dependent commands
- :subcommand-handlers - For subcommand-based commands

Example return values:

Simple command:
  (:operations ((:source :positional-args :operation :read)))

Flag-dependent command:
  (:operations :flag-dependent
   :flag-handlers (((\"-i\") . ((:source :positional-args :operation :modify)))))

Subcommand-based command:
  (:operations :complex
   :subcommand-handlers ((add . ((:source :positional-args :operation :read)))))"
  (when (and command-name
             ;; Don't try to intern assignment strings like "DIR=/tmp"
             (not (string-match-p "=" command-name)))
    (alist-get (intern command-name) jf/bash-command-file-semantics)))
#+end_src

** Find Command Custom Handler

The find command requires special handling because it has complex argument structure:
- Initial directory paths (before any expression flags) - classified as :read-directory
- Expression flags like -name that consume the next argument - pattern classified as :match-pattern
- Action flags like -exec that have their own argument structure

We extract both the search directory (:read-directory) and the pattern (:match-pattern).

#+begin_src emacs-lisp
(defun jf/bash--extract-find-operations (parsed-command var-context)
  "Custom extraction for find command operations.

PARSED-COMMAND is the parsed command structure.
VAR-CONTEXT is the variable resolution context.

Find has special argument handling:
- Initial directory paths are classified as :read-directory
- Flag arguments (after -name, -type, etc.) are patterns with :match-pattern
- When flags are present, only first positional arg is treated as directory
- When no flags, all positional args are directory paths

Returns list of operation plists with :read-directory for search paths
and :match-pattern for -name patterns."
  (let* ((positional-args (plist-get parsed-command :positional-args))
         (flags (plist-get parsed-command :flags))
         (command-name (plist-get parsed-command :command-name))
         (operations nil)
         (search-dir nil)
         (name-pattern nil))

    ;; Find argument structure: find [paths...] [expression...]
    ;; The parser puts directory paths AND flag argument values in positional-args
    ;; Flags themselves go into the :flags list

    ;; Extract search directory (first positional arg before flags)
    (when positional-args
      (setq search-dir (car positional-args)))

    ;; Find -name argument (pattern after -name flag)
    ;; The pattern is in positional-args after the directory
    (let ((i 0))
      (while (< i (length positional-args))
        (when (and (> i 0)  ; Skip first arg (directory)
                   (member "-name" flags))
          ;; If we have -name flag, the second positional arg is the pattern
          (setq name-pattern (nth 1 positional-args)))
        (setq i (1+ i))))

    ;; Add :read-directory operation for search location
    (when search-dir
      (let* ((resolved-path (jf/bash--resolve-path-variables search-dir var-context))
             (final-path (if (stringp resolved-path)
                            resolved-path
                          (plist-get resolved-path :path)))
             (unresolved-vars (when (listp resolved-path)
                               (plist-get resolved-path :unresolved))))
        (push (append (list :file final-path
                           :operation :read-directory
                           :confidence :high
                           :source :positional-arg
                           :command command-name)
                     (when unresolved-vars
                       (list :unresolved t :unresolved-vars unresolved-vars)))
              operations)))

    ;; Add :match-pattern operation for the pattern
    (when name-pattern
      (let* ((resolved-path (jf/bash--resolve-path-variables name-pattern var-context))
             (final-path (if (stringp resolved-path)
                            resolved-path
                          (plist-get resolved-path :path)))
             (unresolved-vars (when (listp resolved-path)
                               (plist-get resolved-path :unresolved))))
        (push (append (list :file final-path
                           :operation :match-pattern
                           :confidence :high
                           :source :flag-arg
                           :pattern t
                           :search-scope search-dir
                           :command command-name)
                     (when unresolved-vars
                       (list :unresolved t :unresolved-vars unresolved-vars)))
              operations)))

    (nreverse operations)))
#+end_src

** Ls Command Custom Handler

The ls command requires special handling because it distinguishes between:
- Literal paths (no operations - ls just lists)
- Glob patterns (match-pattern operations - ls searches for matching files)

#+begin_src emacs-lisp
(defun jf/bash--extract-ls-operations (parsed-command var-context)
  "Custom extraction for ls command operations.

PARSED-COMMAND is the parsed command structure.
VAR-CONTEXT is the variable resolution context.

Ls without args lists current directory (no operation).
Ls with glob patterns searches for matching files (:match-pattern).
Ls with literal paths just lists (no operation).

Returns list of operation plists."
  (let* ((positional-args (plist-get parsed-command :positional-args))
         (command-name (plist-get parsed-command :command-name))
         (operations nil))

    (when positional-args
      ;; Check each arg for glob patterns
      (dolist (arg positional-args)
        (let* ((resolved-path (jf/bash--resolve-path-variables arg var-context))
               (final-path (if (stringp resolved-path)
                              resolved-path
                            (plist-get resolved-path :path)))
               (unresolved-vars (when (listp resolved-path)
                                 (plist-get resolved-path :unresolved))))
          (when (jf/bash--has-glob-pattern-p final-path)
            ;; Glob pattern - match-pattern operation
            (push (append (list :file final-path
                               :operation :match-pattern
                               :confidence :high
                               :source :positional-arg
                               :pattern t
                               :command command-name)
                         (when unresolved-vars
                           (list :unresolved t :unresolved-vars unresolved-vars)))
                  operations)))))

    (nreverse operations)))
#+end_src

** Head/Tail Command Custom Handler

The head and tail commands have flags that consume numeric arguments:
- -n NUM (number of lines)
- -c NUM (number of bytes)

These numeric arguments end up in positional-args and should be skipped.

#+begin_src emacs-lisp
(defun jf/bash--extract-head-tail-operations (parsed-command var-context)
  "Custom extraction for head/tail command operations.

PARSED-COMMAND is the parsed command structure.
VAR-CONTEXT is the variable resolution context.

Head/tail have flags that consume numeric arguments (-n NUM, -c NUM).
These arguments end up in positional-args and should be skipped.

Strategy: count how many flags that take arguments are present,
then skip that many positional args from the beginning.

Returns list of operation plists."
  (let* ((positional-args (plist-get parsed-command :positional-args))
         (flags (plist-get parsed-command :flags))
         (command-name (plist-get parsed-command :command-name))
         (operations nil))

    ;; Flags that consume the next argument
    (let ((arg-consuming-flags '("-n" "-c"))
          (num-args-to-skip 0))

      ;; Count how many positional args are consumed by flags
      (dolist (flag flags)
        (when (member flag arg-consuming-flags)
          (setq num-args-to-skip (1+ num-args-to-skip))))

      ;; Extract file operations from remaining positional args
      (when positional-args
        (let ((file-args (nthcdr num-args-to-skip positional-args)))
          (dolist (arg file-args)
            (let* ((resolved-path (jf/bash--resolve-path-variables arg var-context))
                   (final-path (if (stringp resolved-path)
                                  resolved-path
                                (plist-get resolved-path :path)))
                   (unresolved-vars (when (listp resolved-path)
                                     (plist-get resolved-path :unresolved))))
              (push (append (list :file final-path
                                 :operation :read
                                 :confidence :high
                                 :source :positional-arg
                                 :command command-name)
                           (when unresolved-vars
                             (list :unresolved unresolved-vars)))
                    operations))))))

    (nreverse operations)))
#+end_src

** Tar Command Custom Handler

The tar command requires special handling because:
- The -f flag specifies the archive file (next positional arg)
- Operation depends on flags: -c (create) writes archive and reads sources,
  -x (extract) reads archive
- Flags can be bundled (-czf combines -c, -z, -f)

#+begin_src emacs-lisp
(defun jf/bash--extract-tar-operations (parsed-command var-context)
  "Custom extraction for tar command operations.

PARSED-COMMAND is the parsed command structure.
VAR-CONTEXT is the variable resolution context.

Tar has flag-dependent behavior:
- -c (create): reads source files, writes archive
- -x (extract): reads archive
- -f FILE: next positional arg is the archive file
- Other args are source files/directories (for create)

Flags are often bundled: -czf = -c -z -f

Returns list of operation plists."
  (let* ((positional-args (plist-get parsed-command :positional-args))
         (flags (plist-get parsed-command :flags))
         (command-name (plist-get parsed-command :command-name))
         (operations nil))

    (when positional-args
      ;; Determine operation mode from flags
      (let* ((all-flags (string-join flags ""))
             (is-create (or (string-match-p "c" all-flags)
                           (member "--create" flags)))
             (is-extract (or (string-match-p "x" all-flags)
                            (member "--extract" flags)
                            (member "--get" flags)))
             (has-file-flag (or (string-match-p "f" all-flags)
                               (member "--file" flags)))
             ;; For tar with -f, first positional arg is archive file
             (archive-file (when has-file-flag (car positional-args)))
             (source-files (when has-file-flag (cdr positional-args))))

        ;; Create mode: read sources, write archive
        (when (and is-create archive-file)
          ;; Write the archive file
          (let* ((resolved-path (jf/bash--resolve-path-variables archive-file var-context))
                 (final-path (if (stringp resolved-path)
                                resolved-path
                              (plist-get resolved-path :path)))
                 (unresolved-vars (when (listp resolved-path)
                                   (plist-get resolved-path :unresolved))))
            (push (append (list :file final-path
                               :operation :write
                               :confidence :high
                               :source :positional-arg
                               :command command-name)
                         (when unresolved-vars
                           (list :unresolved unresolved-vars)))
                  operations))

          ;; Read the source files
          (dolist (source source-files)
            (let* ((resolved-path (jf/bash--resolve-path-variables source var-context))
                   (final-path (if (stringp resolved-path)
                                  resolved-path
                                (plist-get resolved-path :path)))
                   (unresolved-vars (when (listp resolved-path)
                                     (plist-get resolved-path :unresolved))))
              (push (append (list :file final-path
                                 :operation :read
                                 :confidence :high
                                 :source :positional-arg
                                 :command command-name)
                           (when unresolved-vars
                             (list :unresolved unresolved-vars)))
                    operations))))

        ;; Extract mode: read archive
        (when (and is-extract archive-file)
          (let* ((resolved-path (jf/bash--resolve-path-variables archive-file var-context))
                 (final-path (if (stringp resolved-path)
                                resolved-path
                              (plist-get resolved-path :path)))
                 (unresolved-vars (when (listp resolved-path)
                                   (plist-get resolved-path :unresolved))))
            (push (append (list :file final-path
                               :operation :read
                               :confidence :high
                               :source :positional-arg
                               :command command-name)
                         (when unresolved-vars
                           (list :unresolved unresolved-vars)))
                  operations)))))

    (nreverse operations)))
#+end_src

