config/experiments/bash-parser/bash-parser-semantics.org
** Zip Command Custom Handler

The zip command has simple structure:
- First positional arg is the zip file (write operation)
- Remaining args are source files/directories (read operations)

#+begin_src emacs-lisp
(defun jf/bash--extract-zip-operations (parsed-command var-context)
  "Custom extraction for zip command operations.

PARSED-COMMAND is the parsed command structure.
VAR-CONTEXT is the variable resolution context.

Zip structure:
- First positional arg is the zip file (write)
- Remaining args are source files/directories (read)

Returns list of operation plists."
  (let* ((positional-args (plist-get parsed-command :positional-args))
         (command-name (plist-get parsed-command :command-name))
         (operations nil))

    (when positional-args
      (let ((zip-file (car positional-args))
            (source-files (cdr positional-args)))

        ;; Write the zip file
        (let* ((resolved-path (jf/bash--resolve-path-variables zip-file var-context))
               (final-path (if (stringp resolved-path)
                              resolved-path
                            (plist-get resolved-path :path)))
               (unresolved-vars (when (listp resolved-path)
                                 (plist-get resolved-path :unresolved))))
          (push (append (list :file final-path
                             :operation :write
                             :confidence :high
                             :source :positional-arg
                             :command command-name)
                       (when unresolved-vars
                         (list :unresolved unresolved-vars)))
                operations))

        ;; Read the source files
        (dolist (source source-files)
          (let* ((resolved-path (jf/bash--resolve-path-variables source var-context))
                 (final-path (if (stringp resolved-path)
                                resolved-path
                              (plist-get resolved-path :path)))
                 (unresolved-vars (when (listp resolved-path)
                                   (plist-get resolved-path :unresolved))))
            (push (append (list :file final-path
                               :operation :read
                               :confidence :high
                               :source :positional-arg
                               :command command-name)
                         (when unresolved-vars
                           (list :unresolved unresolved-vars)))
                  operations)))))

    (nreverse operations)))
#+end_src

* Provide

#+begin_src emacs-lisp
(provide 'bash-parser-semantics)
;;; bash-parser-semantics.el ends here
#+end_src
